BtmsGatewayStub/Services/Simulation/Examples/CdsToAlvsFinalisationNotification.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soap:Header>
        <oas:Security soap:role="system" soap:mustUnderstand="true">
            <oas:UsernameToken>
                <oas:Username>systemID=ALVSHMRCCDS,ou=gsi systems,o=cds</oas:Username>
                <oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</oas:Password>
            </oas:UsernameToken>
        </oas:Security>
    </soap:Header>
    <soap:Body>
        <FinalisationNotificationRequest xmlns="http://notifyfinalisedstatehmrcfacade.types.esb.ws.cara.defra.com">
            <ServiceHeader>
                <SourceSystem>CDS</SourceSystem>
                <DestinationSystem>ALVS</DestinationSystem>
                <CorrelationId>1234567890123456789</CorrelationId>
                <ServiceCallTimestamp>2008-01-01T12:12:12.123</ServiceCallTimestamp>
            </ServiceHeader>
            <Header>
                <EntryReference>123-123456A-01/01/2008</EntryReference>
                <EntryVersionNumber>4</EntryVersionNumber>
                <DecisionNumber>3</DecisionNumber>
                <FinalState>0</FinalState>
                <ManualAction>N</ManualAction>
            </Header>
        </FinalisationNotificationRequest>
    </soap:Body>
</soap:Envelope>